In [2]:
import pandas

In [5]:
df = pandas.read_csv("full.csv")

In [6]:
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

what are data look like?

In [7]:
df.shape

(313400, 10)

more imformation?

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 313400 entries, 0 to 313399
Data columns (total 10 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   YEAR       313400 non-null  int64
 1   MONTH      313400 non-null  object
 2   DAY        313400 non-null  int64
 3   HOUR       313400 non-null  int64
 4   MINUTE     313400 non-null  int64
 5   SECOND     313400 non-null  float64
 6   LATITUDE   313400 non-null  float64
 7   LONGITUDE  313400 non-null  float64
 8   DEPTH      313400 non-null  int64
 9   MAGNITUDE  313400 non-null  float64
dtypes: float64(4), int64(5), object(1)
memory usage: 23.9+ MB

let's change a setting in jupyter, modify pandas to display 12 columns
also display 64 rows

In [32]:
pandas.set_option('display.max_columns', 12)
pandas.set_option('display.max_rows', 64)
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [33]:
pandas.reset_option('display.max_columns')
pandas.reset_option('display.max_rows')
df

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.9000,23.9000,10,5.3
1,1964,APR,11,16,0,0.0,39.7500,25.2500,10,5.7
2,1964,APR,21,8,14,40.0,38.5000,22.2500,10,4.5
3,1964,APR,24,3,49,58.0,38.0000,21.8000,10,5.0
4,1964,APR,29,4,21,0.0,39.2500,23.7500,10,5.8
...,...,...,...,...,...,...,...,...,...,...
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

In [28]:
pd_schema = pandas.read_csv("schema.csv")
pd_schema

      COLUMN                   ATTRIBUTE
0       YEAR       event Date: Year XXXX
1      MONTH      event Date: Month abbr
2        DAY             event Date: Day
3       HOUR  event Time (GMT): Hour 24h
4     MINUTE    event Time (GMT): Minute
5     SECOND    event Time (GMT): Second
6   LATITUDE          event Latitude (N)
7  LONGITUDE         event Longitude (E)
8      DEPTH            event Depth (km)
9  MAGNITUDE          event Magnitude Mr

In [25]:
pd_schema.shape

(10, 2)

In [26]:
pd_schema.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   COLUMN     10 non-null     object
 1   ATTRIBUTE  10 non-null     object
dtypes: object(2)
memory usage: 288.0+ bytes

methods to only see a certain number of rows

In [34]:
df.head()

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.90,23.90,10,5.3
1,1964,APR,11,16,0,0.0,39.75,25.25,10,5.7
2,1964,APR,21,8,14,40.0,38.50,22.25,10,4.5
3,1964,APR,24,3,49,58.0,38.00,21.80,10,5.0
4,1964,APR,29,4,21,0.0,39.25,23.75,10,5.8

In [35]:
df.tail()

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
313395,2021,APR,9,5,0,7.4,39.7856,21.9081,5,0.6
313396,2021,APR,9,5,0,21.9,39.7920,21.9328,5,1.5
313397,2021,APR,9,5,1,6.5,39.7160,22.1947,8,1.0
313398,2021,APR,9,5,2,5.6,39.7929,21.9154,6,1.0
313399,2021,APR,9,5,15,5.0,39.8007,21.8948,7,1.2

just the last 10 rows

In [36]:
df.head(10)

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.90,23.90,10,5.3
1,1964,APR,11,16,0,0.0,39.75,25.25,10,5.7
2,1964,APR,21,8,14,40.0,38.50,22.25,10,4.5
3,1964,APR,24,3,49,58.0,38.00,21.80,10,5.0
4,1964,APR,29,4,21,0.0,39.25,23.75,10,5.8
5,1964,APR,29,17,0,3.0,39.25,23.75,10,5.2
6,1964,APR,30,18,11,0.0,39.25,23.75,10,4.9
7,1964,MAY,2,23,24,0.0,39.25,23.75,10,4.2
8,1964,JUL,12,23,32,50.5,38.50,23.25,10,4.4
9,1964,JUL,17,2,34,28.0,38.00,23.50,150,5.8

# 2
what is a dataframe, what does it looks like?

In [38]:
df.head() #first 5 rows

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.90,23.90,10,5.3
1,1964,APR,11,16,0,0.0,39.75,25.25,10,5.7
2,1964,APR,21,8,14,40.0,38.50,22.25,10,4.5
3,1964,APR,24,3,49,58.0,38.00,21.80,10,5.0
4,1964,APR,29,4,21,0.0,39.25,23.75,10,5.8

let's find out how pandas work
by creating a dictionary, every value of which is a list

In [43]:
quakes = {"YEAR": [2022, 2023], 
    "MONTH": ["JAN", "FEB"],
    "DAY": [17, 18],
    "HOUR": [8, 16],
    "MINUTE": [15, 45],
    "SECOND": [20.0, 50.0],
    "LATITUDE": [38, 39],
    "LONGITUDE": [24, 25],
    "DEPTH": [10, 20],
    "MAGNITUDE": [6.5, 7.5]}

In [44]:
quakes

{'YEAR': [2022, 2023],
 'MONTH': ['JAN', 'FEB'],
 'DAY': [17, 18],
 'HOUR': [8, 16],
 'MINUTE': [15, 45],
 'SECOND': [20.0, 50.0],
 'LATITUDE': [38, 39],
 'LONGITUDE': [24, 25],
 'DEPTH': [10, 20],
 'MAGNITUDE': [6.5, 7.5]}

In [46]:
quakes['DEPTH']

[10, 20]

so a DataFrame is created by this kind of dicts

In [45]:
df_quakes = pandas.DataFrame(quakes)
df_quakes

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,2022,JAN,17,8,15,20.0,38,24,10,6.5
1,2023,FEB,18,16,45,50.0,39,25,20,7.5

how to access values of a single column (just like a key of a dict)

In [48]:
df_quakes["MAGNITUDE"]

0    6.5
1    7.5
Name: MAGNITUDE, dtype: float64

but it's so much more

In [50]:
type(df_quakes['MAGNITUDE'])

pandas.core.series.Series

you can see the definition of series online
series: 1d array

dataframe: rows and columns
series: rows of a single

In [52]:
df.MAGNITUDE # we can also access it like that

0         5.3
1         5.7
2         4.5
3         5.0
4         5.8
         ...
313395    0.6
313396    1.5
313397    1.0
313398    1.0
313399    1.2
Name: MAGNITUDE, Length: 313400, dtype: float64

but it's better to use bracket notation, because there could be a method with the same method as our column

In [51]:
type(df_quakes)

pandas.core.frame.DataFrame

a lot more functionality: access multiple columns

In [54]:
df[['LATITUDE', 'LONGITUDE']]

        LATITUDE  LONGITUDE
0        38.9000    23.9000
1        39.7500    25.2500
2        38.5000    22.2500
3        38.0000    21.8000
4        39.2500    23.7500
...          ...        ...
313395   39.7856    21.9081
313396   39.7920    21.9328
313397   39.7160    22.1947
313398   39.7929    21.9154
313399   39.8007    21.8948

[313400 rows x 2 columns]

In [56]:
df.columns

Index(['YEAR', 'MONTH', 'DAY', 'HOUR', 'MINUTE', 'SECOND', 'LATITUDE',
       'LONGITUDE', 'DEPTH', 'MAGNITUDE'],
      dtype='object')

In [57]:
df.iloc[0] # integer location

YEAR         1964
MONTH         FEB
DAY            24
HOUR           23
MINUTE         30
SECOND         25
LATITUDE     38.9
LONGITUDE    23.9
DEPTH          10
MAGNITUDE     5.3
Name: 0, dtype: object

In [58]:
df.iloc[[0, 1]] # be sure to pass an inner list

,YEAR,MONTH,DAY,HOUR,MINUTE,SECOND,LATITUDE,LONGITUDE,DEPTH,MAGNITUDE
0,1964,FEB,24,23,30,25.0,38.90,23.90,10,5.3
1,1964,APR,11,16,0,0.0,39.75,25.25,10,5.7

In [60]:
df.iloc[[0, 1], [0, 8, 9]] # we cant pass names, iloc is integer locations

   YEAR  MAGNITUDE
0  1964        5.3
1  1964        5.7

In [65]:
df.loc[[0, 1], 'MAGNITUDE'] # search by labels

0    5.3
1    5.7
Name: MAGNITUDE, dtype: float64

In [66]:
df.loc[[0, 1, 3], ['LATITUDE', 'LONGITUDE']]

   LATITUDE  LONGITUDE
0     38.90      23.90
1     39.75      25.25
3     38.00      21.80

## RETURN

let's see how many rows and columns

In [68]:
df.shape

(313400, 10)

what columns are available?

In [69]:
df.columns

Index(['YEAR', 'MONTH', 'DAY', 'HOUR', 'MINUTE', 'SECOND', 'LATITUDE',
       'LONGITUDE', 'DEPTH', 'MAGNITUDE'],
      dtype='object')

grab the magnitude column

In [70]:
df['MAGNITUDE'] # get the head and the tail, to see how it looks like

0         5.3
1         5.7
2         4.5
3         5.0
4         5.8
         ...
313395    0.6
313396    1.5
313397    1.0
313398    1.0
313399    1.2
Name: MAGNITUDE, Length: 313400, dtype: float64

count of events with magnitude more than 6

In [72]:
df['MAGNITUDE'].count()

313400

grab rows and columns, we are gonna use col for using labels

In [77]:
df.loc[0:3, 'MAGNITUDE'] # just as slicing, but LAST VALUE IS INCLUSIVE, AND NO BRACKETS!!! we are just passing slice

0    5.3
1    5.7
2    4.5
3    5.0
Name: MAGNITUDE, dtype: float64

In [79]:
df.loc[[0, 1, 2, 3], 'MAGNITUDE']

0    5.3
1    5.7
2    4.5
3    5.0
Name: MAGNITUDE, dtype: float64

In [80]:
df.iloc[0:3, 6:9]

   LATITUDE  LONGITUDE  DEPTH
0     38.90      23.90     10
1     39.75      25.25     10
2     38.50      22.25     10

In [81]:
df.loc[0:3, 'LATITUDE':'MAGNITUDE']

   LATITUDE  LONGITUDE  DEPTH  MAGNITUDE
0     38.90      23.90     10        5.3
1     39.75      25.25     10        5.7
2     38.50      22.25     10        4.5
3     38.00      21.80     10        5.0

# 3